base-files
base-passwd
bash
bsdutils
build-essential
dash
default-libmysqlclient-dev
diffutils
findutils
fzf
google-chrome-stable
grep
gzip
hostname
init
libdebconfclient0
libmagic-dev
libnss3
login
ncurses-base
ncurses-bin
pkg-config
python3-dev
python3-pip
python3-venv
sysvinit-utils
ubuntu-minimal
ubuntu-standard
ubuntu-wsl
unzip
zsh
